VPro/src/InformationRegisters/MobileUserProfiles/MobileUserProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>MobileUserProfiles</name>
  <resources>
    <name>Profile</name>
    <type>
      <types>EnumRef.MobileApplicationProfiles</types>
    </type>
  </resources>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/InformationRegisters/MobileUserProfiles/ManagerModule.bsl
Procedure SetProfileForUser(User, Profile) Export
	
	RecordManager = CreateRecordManager();
	RecordManager.User = User;
	If TypeOf(Profile) = Type("String") Then
		RecordManager.Profile = Enums.MobileApplicationProfiles[Profile];
	Else
		RecordManager.Profile = Profile;
	EndIf;
	RecordManager.Write(True);
	
EndProcedure 

Function UserProfile(User) Export
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	MobileUserProfiles.Profile
		|FROM
		|	InformationRegister.MobileUserProfiles AS MobileUserProfiles
		|WHERE
		|	MobileUserProfiles.User = &User";
	Query.SetParameter("User", User);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Profile;
	Else
		Return "";
	EndIf;
	
EndFunction
